genestealer/everblu-meters-esp8266-improved/src/main.cpp
/*
 * Project: EverBlu Meters ESP8266/ESP32
 * Description: Fetch water/gas usage data from Itron EverBlu Cyble Enhanced RF water and gas meters using the RADIAN protocol on 433 MHz.
 *              Integrated with Home Assistant via MQTT AutoDiscovery.
 *              Supports both water meters (readings in L) and gas meters (readings in m³).
 * Author: Forked and improved by Genestealer, based on work by Psykokwak and Neutrinus.
 * License: Unknown (refer to the README for details).
 *
 * Hardware Requirements:
 * - ESP8266/ESP32
 * - CC1101 RF Transceiver
 *
 * Features:
 * - MQTT integration for Home Assistant
 * - Automatic frequency synthesizer calibration and offset compensation
 * - Wi-Fi diagnostics and OTA updates
 * - Daily scheduled meter readings
 *
 * For more details, refer to the README file.
 */

// Only include private.h in standalone builds, not ESPHome
#if !defined(USE_ESPHOME)
#include "private.h" // Include private configuration (Wi-Fi, MQTT, etc.)
#endif
#include "core/version.h"              // Firmware version definition
#include "core/logging.h"              // Timestamped serial logging macros
#include "core/wifi_serial.h"          // WiFi serial monitor
#include "core/cc1101.h"               // CC1101 RF transceiver and meter data
#include "core/meter_code_parser.h"    // Shared METER_CODE parser
#include "core/utils.h"                 // Utility functions
#include "services/schedule_manager.h"  // Schedule management
#include "services/meter_history.h"      // Shared historical data processing (JSON + serial)
#include "services/frequency_manager.h" // Shared frequency calibration (scan/adaptive/storage)
#if defined(ESP8266)
#include <ESP8266WiFi.h> // Wi-Fi library for ESP8266
#include <ESP8266mDNS.h> // mDNS library for ESP8266
#include <EEPROM.h>      // EEPROM library for ESP8266
#elif defined(ESP32)
#include <WiFi.h>         // Wi-Fi library for ESP32
#include <ESPmDNS.h>      // mDNS library for ESP32
#include <Preferences.h>  // Preferences library for ESP32
#include <esp_task_wdt.h> // Watchdog timer for ESP32
#endif
#include <Arduino.h>       // Core Arduino library
#include <ArduinoOTA.h>    // OTA update library
#include <EspMQTTClient.h> // MQTT client library
#include <math.h>          // For floor/ceil during scan alignment

// Define the LED_BUILTIN pin if missing
#ifndef LED_BUILTIN
#define LED_BUILTIN 2 // Change this pin if needed
#endif

// ------------------------------
// Connectivity watchdog settings
// ------------------------------
// Maximum time to wait for Wi-Fi to connect before forcing a retry
static const unsigned long WIFI_CONNECT_TIMEOUT_MS = 30000UL; // 30s
// Maximum time to wait for MQTT to connect (with Wi-Fi up) before logging a warning
static const unsigned long MQTT_CONNECT_TIMEOUT_MS = 30000UL; // 30s
// If the device stays offline for too long, perform a safety reboot (set to 0 to disable)
static const unsigned long OFFLINE_REBOOT_AFTER_MS = 6UL * 60UL * 60UL * 1000UL; // 6 hours
// LED blink while offline (visual feedback)
static const unsigned long OFFLINE_LED_BLINK_MS = 500UL;

// Define the Wi-Fi PHY mode if missing from the private.h file
#ifndef ENABLE_WIFI_PHY_MODE_11G
#define ENABLE_WIFI_PHY_MODE_11G 0 // Set to 1 to enable 11G PHY mode
#endif

// Define MQTT debugging if missing from the private.h file
#ifndef ENABLE_MQTT_DEBUGGING
#define ENABLE_MQTT_DEBUGGING 0 // Set to 1 to enable MQTT debugging messages
#endif

// Define gas volume divisor if missing from the private.h file
// Converts internal liter count to cubic meters for gas meters
// Default: 100 (equivalent to 0.01 m³ per unit)
#ifndef GAS_VOLUME_DIVISOR
#define GAS_VOLUME_DIVISOR 100
#endif

// Define the default reading schedule if missing from the private.h file.
// Options: presets ("Monday-Friday", "Monday-Saturday", "Monday-Sunday")
// or a specific day ("Monday" through "Sunday")
#ifndef DEFAULT_READING_SCHEDULE
#define DEFAULT_READING_SCHEDULE "Monday-Friday"
#endif

// Optional: configurable daily read time in UTC (hour/minute)
// If not defined in private.h, defaults to 10:00 UTC
#ifndef DEFAULT_READING_HOUR_UTC
#define DEFAULT_READING_HOUR_UTC 10
#endif
#ifndef DEFAULT_READING_MINUTE_UTC
#define DEFAULT_READING_MINUTE_UTC 0
#endif

// Simple time zone offset (minutes from UTC). Positive for east of UTC, negative for west.
#ifndef TIMEZONE_OFFSET_MINUTES
#define TIMEZONE_OFFSET_MINUTES 0
#endif

// Auto-align scheduled reading time to the meter's wake window (time_start/time_end)
// 1 = enabled (default), 0 = disabled
#ifndef AUTO_ALIGN_READING_TIME
#define AUTO_ALIGN_READING_TIME 1
#endif

// Disable automatic scheduled readings entirely. Manual reads (the request-read
// MQTT command / button) still work. 0 = scheduled readings enabled (default),
// 1 = disabled. Opt-in, mirroring the negative-form flags elsewhere.
#ifndef DISABLE_SCHEDULED_READINGS
#define DISABLE_SCHEDULED_READINGS 0
#endif

// Alignment strategy: 0 = use time_start, 1 = use midpoint of [time_start, time_end]
#ifndef AUTO_ALIGN_USE_MIDPOINT
#define AUTO_ALIGN_USE_MIDPOINT 1
#endif

// Control whether the firmware performs the Deep auto scan on first boot
// 1 = enabled (default), 0 = disabled
#ifndef AUTO_SCAN_ENABLED
#define AUTO_SCAN_ENABLED 1
#endif

// Control whether the firmware automatically runs a frequency scan after a full
// streak of failed reads (when entering the cooldown period). This helps users
// who never trigger a manual scan recover from meter carrier-frequency drift.
// 0 = disabled (default), 1 = enabled
#ifndef AUTO_SCAN_ON_FAILURE_ENABLED
#define AUTO_SCAN_ON_FAILURE_ENABLED 0
#endif

// Resolved reading time (UTC) which may be updated dynamically after a successful read
// Resolved reading time:
// - UTC fields: scheduled time in UTC
// - Local fields: scheduled time in UTC+offset (TIMEZONE_OFFSET_MINUTES)
// These may be updated dynamically after a successful read (auto-align).
static int g_readHourUtc = DEFAULT_READING_HOUR_UTC;
static int g_readMinuteUtc = DEFAULT_READING_MINUTE_UTC;
static int g_readHourLocal = DEFAULT_READING_HOUR_UTC;
static int g_readMinuteLocal = DEFAULT_READING_MINUTE_UTC;

