genestealer/everblu-meters-esp8266-improved/src/main.cpp
// Flag to indicate if current data read is from scheduled trigger (vs manual MQTT command)
// Used to control whether auto-alignment should be applied to future scheduled reads
static bool g_isScheduledRead = false;

// Year-aware date key (see ScheduleManager::dateKey) of the last scheduled read,
// or -1 if none yet. Guards the scheduled read to once per day across the whole
// scheduled minute (see onScheduled). onScheduled() is re-armed on every reconnect,
// so several poll chains can run at once; this latch keeps them collectively to a
// single read per occurrence.
static int g_lastScheduledReadDateKey = -1;

// Date key of an occurrence that was due but deferred by a cooldown or a running
// scan, or -1 if none is owed. A staged scan can outlast the scheduled minute, so
// re-sampling the clock once it finishes would no longer match and the day would
// be skipped; the occurrence is remembered instead and serviced when the blocker
// clears. Cleared on the day rolling over, since that occurrence is then gone.
static int g_pendingScheduledReadDateKey = -1;

// Define a default meter frequency if missing from private.h.
// RADIAN protocol nominal center frequency for EverBlu is 433.82 MHz.
#ifndef FREQUENCY
#define FREQUENCY 433.82
#define FREQUENCY_DEFINED_DEFAULT 1
#else
#define FREQUENCY_DEFINED_DEFAULT 0
#endif

unsigned long lastWifiUpdate = 0;

// Read success/failure metrics
unsigned long totalReadAttempts = 0;
unsigned long successfulReads = 0;
unsigned long failedReads = 0;
const char *lastErrorMessage = "None";

// CC1101 radio connection state
bool cc1101RadioConnected = false; // Tracks whether the radio is detected and initialized

// Frequency offset storage. The EEPROM/Preferences layout and all scan/adaptive
// state now live in the shared FrequencyManager (src/services/frequency_manager.cpp),
// which this build initializes in setup(). EEPROM_SIZE is retained only for the
// optional CLEAR_EEPROM_ON_BOOT maintenance path below.
#define EEPROM_SIZE 64
bool autoScanEnabled = (AUTO_SCAN_ENABLED != 0);                     // Enable automatic scan on first boot if no offset found
bool autoScanOnFailureEnabled = (AUTO_SCAN_ON_FAILURE_ENABLED != 0); // Enable automatic scan after max retries reached

// Define the adaptive frequency tracking threshold if missing from private.h
// Controls how many successful reads trigger a frequency adjustment
// Default: 1 (adjust after every read, ideal for once-per-day schedules)
// Increase to 5-10 for more stable reading conditions
#ifndef ADAPTIVE_THRESHOLD
#define ADAPTIVE_THRESHOLD 1
#endif
const int ADAPT_THRESHOLD = ADAPTIVE_THRESHOLD;

// Front-end RX attenuation, reported by the diagnostic report. The driver applies its own
// default when this is absent from private.h; mirror it so the report agrees with the radio.
#ifndef RX_ATTENUATION_DB
#define RX_ATTENUATION_DB 0
#endif

// Size of the retained JSON payload carrying the diagnostic report. The report itself is
// capped at CC1101_REPORT_BUFFER_SIZE; the headroom covers the JSON wrapper and the escaped
// newline after each of its ~17 lines. Must stay within the MQTT max packet size set below.
#define DIAGNOSTIC_REPORT_PAYLOAD_SIZE (CC1101_REPORT_BUFFER_SIZE + 256)

// ============================================================================
// Frequency Management API (thin MQTT wrappers over the shared FrequencyManager)
// ============================================================================

/**
 * @brief Perform a Deep frequency scan
 *
 * Starts staged acquisition and refinement around the configured frequency.
 * Also used on first boot when no stored offset exists.
 *
 * Saves discovered offset to persistent storage on success.
 */
void performDeepFrequencyScan(float scanRangeMHz = 0.150f, float scanStepMHz = 0.010f);
static void startRecoveryScan(bool retryRead);

/**
 * @brief Erase the persisted frequency calibration and re-tune the radio.
 */
void resetFrequencyOffset();

/**
 * @brief Log the wiring / SPI link / radio diagnostic report to the serial monitor.
 *
 * Same block as the ESPHome "Diagnostic Report" button, so one format covers both
 * integrations. Safe to call when the radio never came up, which is when it is most
 * useful.
 */
void printDiagnosticReport();

// ============================================================================
// Frequency Management Implementation
// ============================================================================

/**
 * @brief Adaptive frequency tracking using FREQEST
 *
 * Accumulates frequency offset estimates from successful reads and gradually
 * adjusts radio frequency to track meter drift. Uses statistical averaging
 * (ADAPT_THRESHOLD reads) to avoid over-correction on noise.
 *
 * FREQEST register provides frequency error estimate in 2's complement format,
 * with resolution ~1.59 kHz per LSB (26 MHz crystal).
 *
 * Adjustment logic:
 * - Accumulate FREQEST over multiple reads
 * - After threshold reads, calculate average error
 * - If average > 2 kHz, apply 50% correction to avoid oscillation
 * - Save new offset to persistent storage
 * - Reinitialize CC1101 with corrected frequency
 *
 * @param freqest Frequency offset estimate from CC1101 FREQEST register (-128 to +127)
 */
void adaptiveFrequencyTracking(int8_t freqest);

// Secrets pulled from private.h file
// Note: MQTT Client ID is made unique per device by appending the meter serial number
// This prevents multiple devices from having the same client ID and causing MQTT connection conflicts

static const char *buildMqttClientIdWithSerial()
{
  static char client_id[64] = {};
  uint8_t year = 0;
  uint32_t serial = 0;
  if (everblu::core::parseMeterCode(METER_CODE, &year, &serial))
  {
    snprintf(client_id, sizeof(client_id), "%s-%lu", SECRET_MQTT_CLIENT_ID, (unsigned long)serial);
  }
  else
  {
    // Keep startup resilient so validation can print a clear error afterward.
    snprintf(client_id, sizeof(client_id), "%s-%s", SECRET_MQTT_CLIENT_ID, METER_CODE);
  }
  return client_id;
}

const char *MQTT_CLIENT_ID_WITH_SERIAL = buildMqttClientIdWithSerial();

