genestealer/everblu-meters-esp8266-improved/src/main.cpp
EspMQTTClient mqtt(
    SECRET_WIFI_SSID,           // Your Wifi SSID
    SECRET_WIFI_PASSWORD,       // Your WiFi key
    SECRET_MQTT_SERVER,         // MQTT Broker server ip
    SECRET_MQTT_USERNAME,       // MQTT Username Can be omitted if not needed
    SECRET_MQTT_PASSWORD,       // MQTT Password Can be omitted if not needed
    MQTT_CLIENT_ID_WITH_SERIAL, // MQTT Client name: uniquely identifies device by appending meter serial
    1883                        // MQTT Broker server port
);

// Base MQTT topic prefix for all EverBlu Cyble entities
// Centralising this avoids repeating "everblu/cyble/" all over the code.
// mqttBaseTopic is populated during setup() after parsing METER_CODE.

const char jsonTemplate[] = "{ "
                            "\"liters\": %d, "
                            "\"counter\" : %d, "
                            "\"battery\" : %d, "
                            "\"rssi\" : %d, "
                            "\"timestamp\" : \"%s\" }";

// Define the default maximum retries if missing from the private.h file
#ifndef MAX_RETRIES
#define MAX_RETRIES 5 // Default: 5 retry attempts before cooldown
#endif

int _retry = 0;
const int max_retries = MAX_RETRIES;          // Maximum number of retry attempts (configurable in private.h)
unsigned long lastFailedAttempt = 0;          // Timestamp of last failed attempt
// The flag, rather than a non-zero lastFailedAttempt, is what marks the cooldown
// as running: millis() legitimately returns 0 for the first millisecond after
// boot, and a failure landing there must not skip the cooldown entirely. This
// mirrors MeterReader::m_inCooldown so both deployment paths behave the same.
bool g_inCooldown = false;
const unsigned long RETRY_COOLDOWN = 3600000; // 1 hour cooldown in milliseconds
bool g_autoScanAfterFailureDone = false;      // Guards the failure-recovery frequency scan to once per failure streak
bool g_postScanReadAttempted = false;         // Guards the single post-scan re-read to once per failure streak
bool g_scanActive = false;
bool g_scanRetryRead = false;
float g_scanPreviousOffset = 0.0f;
ReadFailure g_retryFailureReason = ReadFailure::None; // Most informative failure seen so far in the current retry sequence

// Non-blocking NTP synchronisation state. configTzTime() is kicked off in
// onConnectionEstablished() and the clock is polled from loop() so MQTT
// keep-alives and OTA are never stalled by a blocking wait on every reconnect.
const time_t NTP_MIN_VALID_EPOCH = 1609459200; // 2021-01-01
const unsigned long NTP_SYNC_TIMEOUT_MS = 10000;
bool g_awaitingNtpSync = false;
unsigned long g_ntpSyncStartMs = 0;

// Global variable to store the reading schedule (default from private.h)
const char *readingSchedule = DEFAULT_READING_SCHEDULE;

// Helper variables for generating serial-prefixed MQTT topics and entity IDs.
// They are filled by parseMeterCode() in setup() before last-will configuration.
// Format: everblu/cyble/{serial} (or everblu/cyble if meter prefix is disabled)
// Compile-time check: Ensure METER_CODE is defined
#if !defined(METER_CODE)
#error "METER_CODE must be defined in private.h"
#endif

// Define meter prefix option if not defined in private.h (default to enabled)
#ifndef ENABLE_METER_PREFIX_IN_ENTITY_IDS
#define ENABLE_METER_PREFIX_IN_ENTITY_IDS 1
#endif

// Define Home Assistant MQTT discovery option if not defined in private.h (default to enabled)
#ifndef ENABLE_HA_DISCOVERY
#define ENABLE_HA_DISCOVERY 1
#endif

// Buffer sizes for MQTT topics are intentionally conservative for future-proofing.
// Current worst-case payloads are significantly smaller than these buffers.
// Parsed at runtime from METER_CODE by parseMeterCode() called at the start of setup()
static uint8_t g_meterYear = 0;
static uint32_t g_meterSerial = 0;
char meterSerialStr[16] = {}; // filled by parseMeterCode()
#if ENABLE_METER_PREFIX_IN_ENTITY_IDS
char mqttBaseTopic[64] = {}; // filled by parseMeterCode()
char mqttLwtTopic[80] = {};  // filled by parseMeterCode()
#else
char mqttBaseTopic[64] = "everblu/cyble";       // Base MQTT topic without meter serial
char mqttLwtTopic[80] = "everblu/cyble/status"; // LWT status topic without serial number
#endif

/**
 * Parse METER_CODE ("YY-SSSSSSS" or "YY-SSSSSSS-NNN") into g_meterYear,
 * g_meterSerial, and
 * the MQTT topic buffers.  Called once at the very start of setup().
 */
static void parseMeterCode()
{
  if (!everblu::core::parseMeterCode(METER_CODE, &g_meterYear, &g_meterSerial))
  {
    TS_PRINTLN("[ERROR] Invalid METER_CODE - expected YY-serial or YY-serial-NNN (with dashes)");
    return;
  }

  snprintf(meterSerialStr, sizeof(meterSerialStr), "%lu", (unsigned long)g_meterSerial);
#if ENABLE_METER_PREFIX_IN_ENTITY_IDS
  snprintf(mqttBaseTopic, sizeof(mqttBaseTopic), "everblu/cyble/%lu", (unsigned long)g_meterSerial);
  snprintf(mqttLwtTopic, sizeof(mqttLwtTopic), "everblu/cyble/%lu/status", (unsigned long)g_meterSerial);
#endif
}

// Standard buffer size for constructing MQTT topic strings
// Calculation: mqttBaseTopic (max 63) + longest suffix "/wifi_signal_percentage" (24) + null (1) = 88 bytes
// Buffer size: 128 bytes provides 1.45x safety margin for topic construction
#define MQTT_TOPIC_BUFFER_SIZE 128

// Publish to "<mqttBaseTopic>/<suffix>" without building the topic as an
// Arduino String. A single read publishes around 20 topics, and every
// String(mqttBaseTopic) + "/suffix" allocated and freed two heap blocks, which
// fragments the ~40 KB ESP8266 heap over the life of the device. The rest of
// the file already builds topics into a stack buffer; this keeps the hot path
// consistent with that.
static bool publishSub(const char *suffix, const char *payload, bool retain = false)
{
  char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/%s", mqttBaseTopic, suffix);
  return mqtt.publish(topicBuffer, payload, retain);
}

// ============================================================================
// Meter Type Configuration
// ============================================================================

// Define meter type if not defined in private.h (default to water)
#ifndef METER_TYPE
#define METER_TYPE "water"
#endif

// Meter-specific configuration based on METER_TYPE
// These variables control the Home Assistant device class, icon, and unit of measurement
const char *meterDeviceClass;
const char *meterIcon;
const char *meterUnit;
// Compile-time string equality helper to avoid runtime strcmp for meter type
constexpr bool strEq(const char *a, const char *b)
{
  return (*a == *b) && (*a == '\0' || strEq(a + 1, b + 1));
}
constexpr bool meterIsGas = strEq(METER_TYPE, "gas");

// Initialize meter configuration
static void initMeterTypeConfig()
{
  if (meterIsGas)
  {
    meterDeviceClass = "gas";
    meterIcon = "mdi:meter-gas";
    meterUnit = "m³";
    TS_PRINTLN("[STATUS] Meter type: GAS (readings in m³)");
  }
  else
  {
    meterDeviceClass = "water";
    meterIcon = "mdi:water";
    meterUnit = "L";
    TS_PRINTLN("[STATUS] Meter type: WATER (readings in L)");
  }
}

// ============================================================================
// Schedule Validation API
// ============================================================================

// Note: isValidReadingSchedule() is now in utils.h/cpp

/**
 * @brief Validate and correct reading schedule
 *
 * Checks if current reading schedule is valid. If invalid, falls back
 * to safe default ("Monday-Friday") and logs a warning.
 */
static void validateReadingSchedule()
{
  if (!isValidReadingSchedule(readingSchedule))
  {
    TS_PRINTF("[WARNING] Invalid reading schedule '%s'. Falling back to 'Monday-Friday'.\n", readingSchedule);
    readingSchedule = "Monday-Friday";
  }
}

/**
 * @brief Update cached schedule times based on a local (UTC+offset) time
 */
static void updateResolvedScheduleFromLocal(int hourLocal, int minuteLocal)
{
  int normalizedHour = constrain(hourLocal, 0, 23);
  int normalizedMinute = constrain(minuteLocal, 0, 59);

  g_readHourLocal = normalizedHour;
  g_readMinuteLocal = normalizedMinute;

