genestealer/everblu-meters-esp8266-improved/src/main.cpp
  int totalLocalMin = normalizedHour * 60 + normalizedMinute;
  int utcMin = (totalLocalMin - TIMEZONE_OFFSET_MINUTES) % (24 * 60);
  if (utcMin < 0)
    utcMin += 24 * 60;
  g_readHourUtc = utcMin / 60;
  g_readMinuteUtc = utcMin % 60;
}

/**
 * @brief Update cached schedule times based on a UTC time
 */
static void updateResolvedScheduleFromUtc(int hourUtc, int minuteUtc)
{
  int normalizedHour = constrain(hourUtc, 0, 23);
  int normalizedMinute = constrain(minuteUtc, 0, 59);

  g_readHourUtc = normalizedHour;
  g_readMinuteUtc = normalizedMinute;

  int totalUtcMin = normalizedHour * 60 + normalizedMinute;
  int localMin = (totalUtcMin + TIMEZONE_OFFSET_MINUTES) % (24 * 60);
  if (localMin < 0)
    localMin += 24 * 60;
  g_readHourLocal = localMin / 60;
  g_readMinuteLocal = localMin % 60;
}

// Note: isReadingDay() is now in ScheduleManager class

// ============================================================================
// Signal Quality Conversion API
// ============================================================================

/**
 * @brief Convert WiFi RSSI to percentage
 *
 * Maps WiFi RSSI value to 0-100% scale for user-friendly display.
 * Clamps input to reasonable range (-100 to -50 dBm).
 *
 * @param rssi WiFi RSSI in dBm (typically -100 to -50)
 * @return Signal strength as percentage (0-100)
 */
int calculateWiFiSignalStrengthPercentage(int rssi)
{
  int strength = constrain(rssi, -100, -50); // Clamp RSSI to a reasonable range
  return map(strength, -100, -50, 0, 100);   // Map RSSI to percentage (0-100%)
}

// Note: calculateMeterdBmToPercentage() and calculateLQIToPercentage() are now in utils.h/cpp

// ------------------------------
// Connectivity watchdog state
// ------------------------------
static unsigned long g_bootMillis = 0;
static unsigned long g_wifiAttemptStartMs = 0;
static unsigned long g_mqttAttemptStartMs = 0;
static unsigned long g_wifiOfflineSince = 0;
static unsigned long g_mqttOfflineSince = 0;
static unsigned long g_lastConnLogMs = 0;
static unsigned long g_lastLedBlinkMs = 0;
static bool g_ledState = false;
static bool g_prevWifiUp = false;
static bool g_prevMqttUp = false;

// Helper: translate Wi-Fi wl_status_t to readable string
static const char *wifiStatusToString(wl_status_t st)
{
  switch (st)
  {
  case WL_IDLE_STATUS:
    return "IDLE (starting up)";
  case WL_NO_SSID_AVAIL:
    return "NO_SSID_AVAIL (SSID not found)";
  case WL_SCAN_COMPLETED:
    return "SCAN_COMPLETED";
  case WL_CONNECTED:
    return "CONNECTED";
  case WL_CONNECT_FAILED:
    return "CONNECT_FAILED";
  case WL_CONNECTION_LOST:
    return "CONNECTION_LOST";
  case WL_DISCONNECTED:
    return "DISCONNECTED";
#ifdef WL_WRONG_PASSWORD
  case WL_WRONG_PASSWORD:
    return "WRONG_PASSWORD";
#endif
  default:
    return "UNKNOWN";
  }
}

// Function: onUpdateData
// Description: Fetches data from the water and gas meter and publishes it to MQTT topics.
//              Retries up to 10 times if data retrieval fails.
void onUpdateData()
{
  if (FrequencyManager::isScanInProgress()) return;
  Serial.println("");
  EVB_PRINTLN("========================================");
  EVB_PRINTF("        METER READ - START (fw %s)\n", EVERBLU_FW_VERSION);
  EVB_PRINTLN("========================================");
  TS_PRINTF("[STATUS] Updating data from meter...\n");
  TS_PRINTF("[STATUS] Retry count: %d\n", _retry);
  TS_PRINTF("[STATUS] Reading schedule: %s\n", readingSchedule);
  TS_PRINTF("[STATUS] Scheduled read time: %02d:%02d UTC (%02d:%02d local-offset)\n", g_readHourUtc, g_readMinuteUtc, g_readHourLocal, g_readMinuteLocal);

  // Increment total attempts counter
  totalReadAttempts++;

  // Indicate activity with LED
  digitalWrite(LED_BUILTIN, LOW); // Turn on LED to indicate activity

  // Notify MQTT that active reading has started
  publishSub("active_reading", "true", true);
  publishSub("cc1101_state", "Reading", true);

  struct tmeter_data meter_data = get_meter_data(); // Fetch meter data

  // Get current UTC time
  time_t tnow = time(nullptr);
  struct tm *ptm = gmtime(&tnow);
  Serial.println();
  TS_PRINTF("[TIME] Current date (UTC): %04d/%02d/%02d %02d:%02d:%02d - %ld\n", ptm->tm_year + 1900, ptm->tm_mon + 1, ptm->tm_mday, ptm->tm_hour, ptm->tm_min, ptm->tm_sec, (long)tnow);

  char iso8601[128];
  strftime(iso8601, sizeof iso8601, "%FT%TZ", gmtime(&tnow));

  // Handle data retrieval failure (including first-layer protection rejecting
  // corrupted frames and returning zeros).
  if (meter_data.reads_counter == 0 || meter_data.volume == 0)
  {
    TS_PRINTF("[ERROR] Unable to retrieve data from meter (attempt %d/%d)\n", _retry + 1, max_retries);

    // Remember the most informative symptom of the sequence: a run of corrupted
    // frames ending in one silent timeout is still an RF quality problem, so the
    // final message should not fall back to "no response".
    if (meter_data.failure != ReadFailure::None && meter_data.failure != ReadFailure::NoReply)
    {
      g_retryFailureReason = meter_data.failure;
    }

    if (_retry < max_retries - 1)
    {
      // Schedule retry using callback instead of recursion to prevent stack overflow
      _retry++;
      static char errorMsg[128];
      // Deliberately the symptom of THIS attempt, not the sticky
      // g_retryFailureReason: while a sequence is still running the user wants
      // to see what just happened. Only the final message below prefers the
      // most informative symptom of the whole sequence.
      snprintf(errorMsg, sizeof(errorMsg), "Retry %d/%d - %s", _retry, max_retries,
               read_failure_message(meter_data.failure, true));
      lastErrorMessage = errorMsg;
      TS_PRINTF("[STATUS] Scheduling retry in 5 seconds... (next attempt %d/%d)\n", _retry + 1, max_retries);
      // Keep the "Active Reading" sensor true and the radio state as "Reading"
      // for the whole retry sequence so they don't flip to "Not running"/Idle
      // between attempts. They are cleared only on final success or after max
      // retries (see the else branch below).
      publishSub("last_error", lastErrorMessage, true);
      digitalWrite(LED_BUILTIN, HIGH); // Turn off LED
      // Use non-blocking callback instead of recursive call
      mqtt.executeDelayed(5000, onUpdateData);
    }
    else
    {
      // Max retries reached, enter cooldown period
      g_inCooldown = true;
      lastFailedAttempt = millis();
      failedReads++;
      lastErrorMessage = read_failure_message(
          g_retryFailureReason != ReadFailure::None ? g_retryFailureReason : meter_data.failure, false);
      TS_PRINTF("[ERROR] Max retries (%d) reached. Entering 1-hour cooldown period.\n", max_retries);
      publishSub("active_reading", "false", true);
      publishSub("cc1101_state", cc1101RadioConnected ? "Idle" : "unavailable", true);
      publishSub("status_message", "Failed after max retries, cooling down for 1 hour", true);
      publishSub("last_error", lastErrorMessage, true);

      char buffer[16];
      snprintf(buffer, sizeof(buffer), "%lu", failedReads);
      publishSub("failed_reads", buffer, true);

      snprintf(buffer, sizeof(buffer), "%lu", totalReadAttempts);
      publishSub("total_attempts", buffer, true);
      digitalWrite(LED_BUILTIN, HIGH); // Turn off LED
      _retry = 0;                      // Reset retry counter for next scheduled attempt
      g_retryFailureReason = ReadFailure::None;

      // When the meter cannot be reached after all retries, a drifted carrier
      // frequency (crystal offset) is a common cause. Automatically run a
      // frequency scan once per failure streak so users who never trigger a
      // manual scan still get recalibrated. The guard is reset on the next
      // successful read so we don't burn power scanning on every cooldown when
      // the meter is genuinely unreachable (e.g. dead battery).
      if (autoScanOnFailureEnabled && !g_autoScanAfterFailureDone)
      {
        g_autoScanAfterFailureDone = true;
        startRecoveryScan(true);
      }
    }
    EVB_PRINTLN("========================================");
    EVB_PRINTLN("        METER READ - FAILED");
    EVB_PRINTLN("========================================");
    Serial.println("");
    return;
  }

  // Format int time_start and time_end as "HH:MM"
  char timeStartFormatted[6];
  char timeEndFormatted[6];
  int timeStart = constrain(meter_data.time_start, 0, 23); // Ensure valid hour range
  int timeEnd = constrain(meter_data.time_end, 0, 23);     // Ensure valid hour range
  snprintf(timeStartFormatted, sizeof(timeStartFormatted), "%02d:00", timeStart);
  snprintf(timeEndFormatted, sizeof(timeEndFormatted), "%02d:00", timeEnd);

  // Use shared utility function to print meter data
  printMeterDataSummary(&meter_data, meterIsGas, GAS_VOLUME_DIVISOR);

  // Publish meter data to MQTT (using char buffers instead of String)
  // NOTE: meter_data.volume is the raw counter value from the meter (liters for water;
  // for gas, this raw counter is converted to cubic meters using GAS_VOLUME_DIVISOR).
  char valueBuffer[32];

  if (meterIsGas)
  {
    // Gas meters: publish value in m³ (volume / GAS_VOLUME_DIVISOR)
    // Default divisor 100 = 0.01 m³ per unit (typical EverBlu Cyble gas module)
    float cubicMeters = meter_data.volume / (float)GAS_VOLUME_DIVISOR;
    snprintf(valueBuffer, sizeof(valueBuffer), "%.3f", cubicMeters);
  }
  else
  {
    // Water meters: publish value in liters
    snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.volume);
  }
  publishSub("liters", valueBuffer, true);
  delay(5);

  // Publish historical data as JSON attributes for Home Assistant.
  // The 13-month history table, monthly-usage math and JSON formatting all live
  // in the shared MeterHistory service (src/services/meter_history.cpp). MQTT
  // publishes the FULL payload (cumulative history + usage) as an attribute,
  // which has no length limit. The ESPHome build publishes a compact usage-only
  // variant (generateHistoryJsonCompact) because a text-sensor STATE is capped at
  // 255 chars by Home Assistant.
  if (meter_data.history_available && MeterHistory::isHistoryValid(meter_data.history))
  {
    const uint32_t currentVolume = static_cast<uint32_t>(meter_data.volume);

