genestealer/everblu-meters-esp8266-improved/src/main.cpp
  // An occurrence owed by an earlier day is stale: that day is over.
  if (g_pendingScheduledReadDateKey != today) g_pendingScheduledReadDateKey = -1;

  const bool dueNow = ScheduleManager::isReadingDay(ptm) && timeMatch;
  if ((dueNow || g_pendingScheduledReadDateKey == today) && today != g_lastScheduledReadDateKey)
  {
    // Check if we're still in cooldown period after failed attempts.
    // Defer without latching the day, remembering the occurrence so the read can
    // still fire once the cooldown clears, even past the scheduled minute.
    if (g_inCooldown && (millis() - lastFailedAttempt) < RETRY_COOLDOWN)
    {
      unsigned long remainingCooldown = (RETRY_COOLDOWN - (millis() - lastFailedAttempt)) / 1000;
      TS_PRINTF("[WARN] Still in cooldown period. %lu seconds remaining.\n", remainingCooldown);

      char cooldownMsg[64];
      snprintf(cooldownMsg, sizeof(cooldownMsg), "Cooldown active, %lus remaining", remainingCooldown);
      char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
      mqtt.publish(topicBuffer, cooldownMsg, true);
      g_pendingScheduledReadDateKey = today;
      mqtt.executeDelayed(500, onScheduled);
      return;
    }

    // Cooldown period is over, reset and proceed
    g_inCooldown = false;
    lastFailedAttempt = 0;

    // A running scan owns the radio and onUpdateData() would return immediately.
    // Defer without latching the day, as for cooldown, so the read still fires
    // once the scan finishes however long that takes.
    if (FrequencyManager::isScanInProgress())
    {
      g_pendingScheduledReadDateKey = today;
      mqtt.executeDelayed(500, onScheduled);
      return;
    }

    // Mark today serviced so this occurrence reads exactly once, even if another
    // poll (or a second poll chain) observes the same minute.
    g_pendingScheduledReadDateKey = -1;
    g_lastScheduledReadDateKey = today;

    // Call back in 23 hours
    mqtt.executeDelayed(1000 * 60 * 60 * 23, onScheduled);

    EVB_PRINTLN("It is time to update data from meter :)");

    // Update data
    _retry = 0;
    g_isScheduledRead = true; // Mark this read as triggered by scheduler
    onUpdateData();
    return;
  }

  // Check every 500 ms
  mqtt.executeDelayed(500, onScheduled);
}

// ============================================================================
// Home Assistant MQTT Discovery Helper Functions
// ============================================================================
// Supported abbreviations in MQTT discovery messages for Home Assistant
// Used to reduce the size of the JSON payload
// https://www.home-assistant.io/integrations/mqtt/#supported-abbreviations-in-mqtt-discovery-messages

// Helper function to conditionally build meter prefix for entity IDs
// Returns meter serial with underscore suffix if ENABLE_METER_PREFIX_IN_ENTITY_IDS is 1, empty otherwise
String getMeterPrefix()
{
#if ENABLE_METER_PREFIX_IN_ENTITY_IDS
  return String(g_meterSerial) + "_";
#else
  return "";
#endif
}

// Helper function to build JSON device block with METER_SERIAL
String buildDeviceJson()
{
  // Pre-allocate memory to prevent heap fragmentation
  // Estimated size: ~250 bytes for device JSON
  String json;
  json.reserve(300);

#if ENABLE_METER_PREFIX_IN_ENTITY_IDS
  json = "\"ids\": [\"" + String(g_meterSerial) + "\"],\n";
  json += "    \"name\": \"EverBlu Meter " + String(g_meterSerial) + "\",\n";
#else
  // When meter prefix is disabled, use a fixed device ID for single-meter setup
  json = "\"ids\": [\"everblu_meter_device\"],\n";
  json += "    \"name\": \"EverBlu Meter\",\n";
#endif
  json += "    \"mdl\": \"Itron EverBlu Cyble Enhanced Water and Gas Meter ESP8266/ESP32\",\n";
  json += "    \"mf\": \"Genestealer\",\n";
  json += "    \"sw\": \"" EVERBLU_FW_VERSION "\",\n";
  json += "    \"cu\": \"https://github.com/genestealer/everblu-meters-esp8266-improved\"";
  return json;
}

// Helper function to build discovery JSON for a sensor
String buildDiscoveryJson(const char *name, const char *entity_id, const char *icon,
                          const char *unit = nullptr, const char *dev_class = nullptr,
                          const char *state_class = nullptr, const char *ent_category = nullptr)
{
  // Pre-allocate memory to prevent heap fragmentation from multiple reallocations
  // Estimated size: base structure (~350 bytes) + optional fields (~100 bytes)
  String json;
  json.reserve(512);

  json = "{\n";
  json += "  \"name\": \"" + String(name) + "\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + String(entity_id) + "\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + String(entity_id) + "\",\n";
  if (icon)
    json += "  \"ic\": \"" + String(icon) + "\",\n";
  if (unit)
    json += "  \"unit_of_meas\": \"" + String(unit) + "\",\n";
  if (dev_class)
    json += "  \"dev_cla\": \"" + String(dev_class) + "\",\n";
  if (state_class)
    json += "  \"stat_cla\": \"" + String(state_class) + "\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"stat_t\": \"" + String(mqttBaseTopic) + "/" + String(entity_id) + "\",\n";
  json += "  \"frc_upd\": true,\n";
  if (ent_category)
    json += "  \"ent_cat\": \"" + String(ent_category) + "\",\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  return json;
}

// NOTE: Old PROGMEM JSON strings removed - now using dynamic publishHADiscovery() function
// This allows entity IDs and MQTT topics to include METER_SERIAL for multi-meter support

// Function: publishWifiDetails
// Description: Publishes Wi-Fi diagnostics (IP, RSSI, signal strength, etc.) to MQTT.
void publishWifiDetails()
{
  TS_PRINTLN("[MQTT] Publish Wi-Fi details...");

  // Get WiFi details (use String for network functions that return String)
  char wifiIP[16];
  snprintf(wifiIP, sizeof(wifiIP), "%s", WiFi.localIP().toString().c_str());

  int wifiRSSI = WiFi.RSSI();
  int wifiSignalPercentage = calculateWiFiSignalStrengthPercentage(wifiRSSI);

  char macAddress[18];
  snprintf(macAddress, sizeof(macAddress), "%s", WiFi.macAddress().c_str());

  char wifiSSID[33];
  snprintf(wifiSSID, sizeof(wifiSSID), "%s", WiFi.SSID().c_str());

  char wifiBSSID[18];
  snprintf(wifiBSSID, sizeof(wifiBSSID), "%s", WiFi.BSSIDstr().c_str());

