genestealer/everblu-meters-esp8266-improved/src/main.cpp
  // Last Read (timestamp)
  json = "{\n";
  json += "  \"name\": \"Last Read\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_timestamp\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_timestamp\",\n";
  json += "  \"ic\": \"mdi:clock\",\n";
  json += "  \"dev_cla\": \"timestamp\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"stat_t\": \"" + String(mqttBaseTopic) + "/timestamp\",\n";
  json += "  \"frc_upd\": true,\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("sensor", "everblu_meter_timestamp", json);

  // Request Reading Button
  json = "{\n";
  json += "  \"name\": \"Request Reading Now\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_request\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_request\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"cmd_t\": \"" + String(mqttBaseTopic) + "/trigger_force\",\n";
  json += "  \"pl_avail\": \"online\",\n";
  json += "  \"pl_not_avail\": \"offline\",\n";
  json += "  \"pl_prs\": \"update\",\n";
  json += "  \"frc_upd\": true,\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("button", "everblu_meter_request", json);

  // Diagnostic sensors
  publishDiscoveryMessage("sensor", "everblu_meter_wifi_ip", buildDiscoveryJson("IP Address", "wifi_ip", "mdi:ip-network-outline", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_wifi_rssi", buildDiscoveryJson("WiFi RSSI", "wifi_rssi", "mdi:signal-variant", "dBm", "signal_strength", "measurement", "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_mac_address", buildDiscoveryJson("MAC Address", "mac_address", "mdi:network", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_wifi_ssid", buildDiscoveryJson("WiFi SSID", "wifi_ssid", "mdi:help-network-outline", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_wifi_bssid", buildDiscoveryJson("WiFi BSSID", "wifi_bssid", "mdi:access-point-network", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_uptime", buildDiscoveryJson("Device Uptime", "uptime", nullptr, nullptr, "timestamp", nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_wifi_signal_percentage", buildDiscoveryJson("WiFi Signal", "wifi_signal_percentage", "mdi:wifi", "%", nullptr, "measurement", "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_reading_time", buildDiscoveryJson("Reading Time (UTC)", "reading_time", "mdi:clock-outline", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_reading_schedule", buildDiscoveryJson("Reading Schedule", "reading_schedule", "mdi:calendar-clock", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_year", buildDiscoveryJson("Meter Year", "everblu_meter_year", "mdi:calendar", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_serial", buildDiscoveryJson("Meter Serial", "everblu_meter_serial", "mdi:barcode", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_battery_months", buildDiscoveryJson("Months Remaining", "battery", "mdi:battery-clock", "months", nullptr, "measurement", nullptr));
  publishDiscoveryMessage("sensor", "everblu_meter_rssi_dbm", buildDiscoveryJson("RSSI", "rssi_dbm", "mdi:signal", "dBm", "signal_strength", "measurement", nullptr));
  publishDiscoveryMessage("sensor", "everblu_meter_rssi_percentage", buildDiscoveryJson("Signal", "rssi_percentage", "mdi:signal-cellular-3", "%", nullptr, "measurement", nullptr));
  publishDiscoveryMessage("sensor", "everblu_meter_lqi_percentage", buildDiscoveryJson("Signal Quality (LQI)", "lqi_percentage", "mdi:signal-cellular-outline", "%", nullptr, "measurement", nullptr));
  publishDiscoveryMessage("sensor", "everblu_meter_time_start", buildDiscoveryJson("Wake Time", "time_start", "mdi:clock-start", nullptr, nullptr, nullptr, nullptr));
  publishDiscoveryMessage("sensor", "everblu_meter_time_end", buildDiscoveryJson("Sleep Time", "time_end", "mdi:clock-end", nullptr, nullptr, nullptr, nullptr));
  publishDiscoveryMessage("sensor", "everblu_meter_meter_time", buildDiscoveryJson("Meter Clock", "meter_time", "mdi:clock-digital", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_meter_type", buildDiscoveryJson("Meter Type", "meter_type", "mdi:barcode", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_total_attempts", buildDiscoveryJson("Total Read Attempts", "total_attempts", "mdi:counter", nullptr, nullptr, "total_increasing", "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_successful_reads", buildDiscoveryJson("Successful Reads", "successful_reads", "mdi:check-circle", nullptr, nullptr, "total_increasing", "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_failed_reads", buildDiscoveryJson("Failed Reads", "failed_reads", "mdi:alert-circle", nullptr, nullptr, "total_increasing", "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_last_error", buildDiscoveryJson("Last Error", "last_error", "mdi:alert", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_cc1101_state", buildDiscoveryJson("CC1101 State", "cc1101_state", "mdi:radio-tower", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_freq_offset", buildDiscoveryJson("Frequency Offset", "frequency_offset", "mdi:sine-wave", "kHz", nullptr, "measurement", "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_tuned_frequency", buildDiscoveryJson("Tuned Frequency (MHz)", "tuned_frequency", "mdi:radio-tower", "MHz", nullptr, "measurement", "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_freq_estimate", buildDiscoveryJson("Frequency Estimate", "frequency_estimate", "mdi:sine-wave", "kHz", nullptr, "measurement", "diagnostic"));

  // Buttons
  json = "{\n";
  json += "  \"name\": \"Restart Device\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_restart\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_restart\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"cmd_t\": \"" + String(mqttBaseTopic) + "/restart\",\n";
  json += "  \"pl_prs\": \"restart\",\n";
  json += "  \"ent_cat\": \"config\",\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("button", "everblu_meter_restart", json);

  json = "{\n";
  json += "  \"name\": \"Deep Frequency Scan\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_deep_scan\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_deep_scan\",\n";
  json += "  \"ic\": \"mdi:radar\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"cmd_t\": \"" + String(mqttBaseTopic) + "/deep_scan\",\n";
  json += "  \"pl_prs\": \"scan\",\n";
  json += "  \"ent_cat\": \"config\",\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("button", "everblu_meter_deep_scan", json);

  const char *scanCommands[] = {"scan", "stop_scan"};
  const char *scanNames[] = {"Frequency Scan", "Stop Frequency Scan"};
  const char *scanIcons[] = {"mdi:magnify", "mdi:stop-circle-outline"};
  for (size_t index = 0; index < 2; index++)
  {
    String object = String("everblu_meter_") + scanCommands[index];
    json = "{\"name\":\"" + String(scanNames[index]) + "\",\"uniq_id\":\"" + getMeterPrefix() + object;
    json += "\",\"ic\":\"" + String(scanIcons[index]) + "\",\"cmd_t\":\"" + String(mqttBaseTopic) + "/" + scanCommands[index];
    json += "\",\"pl_prs\":\"" + String(index == 0 ? "scan" : "stop") + "\",\"ent_cat\":\"config\",\"dev\":{" + buildDeviceJson() + "}}";
    publishDiscoveryMessage("button", object.c_str(), json);
  }

  json = "{\n";
  json += "  \"name\": \"Reset Frequency Offset\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_reset_frequency\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_reset_frequency\",\n";
  json += "  \"ic\": \"mdi:restore\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"cmd_t\": \"" + String(mqttBaseTopic) + "/reset_frequency\",\n";
  json += "  \"pl_prs\": \"reset\",\n";
  json += "  \"ent_cat\": \"config\",\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("button", "everblu_meter_reset_frequency", json);

  json = "{\n";
  json += "  \"name\": \"Diagnostic Report\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_diagnostic_report\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_diagnostic_report\",\n";
  json += "  \"ic\": \"mdi:clipboard-text-search-outline\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"cmd_t\": \"" + String(mqttBaseTopic) + "/diagnostic_report\",\n";
  json += "  \"pl_prs\": \"report\",\n";
  json += "  \"ent_cat\": \"diagnostic\",\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("button", "everblu_meter_diagnostic_report", json);

  // The report text is far longer than the 255-character limit on a Home Assistant state,
  // so the state is the time it was taken and the text is exposed as a JSON attribute.
  json = "{\n";
  json += "  \"name\": \"Diagnostic Report\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_diagnostic_report_state\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_diagnostic_report_state\",\n";
  json += "  \"ic\": \"mdi:clipboard-text-search-outline\",\n";
  json += "  \"dev_cla\": \"timestamp\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"stat_t\": \"" + String(mqttBaseTopic) + "/diagnostic_report_state\",\n";
  json += "  \"val_tpl\": \"{{ value_json.taken }}\",\n";
  json += "  \"json_attr_t\": \"" + String(mqttBaseTopic) + "/diagnostic_report_state\",\n";
  json += "  \"ent_cat\": \"diagnostic\",\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("sensor", "everblu_meter_diagnostic_report_state", json);

  // Binary sensor for active reading
  json = "{\n";
  json += "  \"name\": \"Active Reading\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_active_reading\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_active_reading\",\n";
  json += "  \"dev_cla\": \"running\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"stat_t\": \"" + String(mqttBaseTopic) + "/active_reading\",\n";
  json += "  \"pl_on\": \"true\",\n";
  json += "  \"pl_off\": \"false\",\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("binary_sensor", "everblu_meter_active_reading", json);

