genestealer/everblu-meters-esp8266-improved/src/main.cpp
  TS_PRINTLN("[MQTT] Home Assistant discovery messages published");
}

// Function: onConnectionEstablished
// Description: Handles MQTT connection establishment, including Home Assistant discovery and OTA setup.
void onConnectionEstablished()
{
  TS_PRINTLN("[MQTT] Connected to MQTT Broker");

  TS_PRINTLN("[TIME] Configuring time from NTP server (non-blocking)...");
  // Note, my VLAN has no WAN/internet, so I am useing Home Assistant Community Add-on: chrony to proxy the time
  configTzTime("UTC0", SECRET_NTP_SERVER);

  // Kick off NTP without blocking. Previously this callback spun in a delay()
  // loop for up to NTP_SYNC_TIMEOUT_MS, stalling mqtt.loop()/OTA on every
  // reconnect. pollNtpSync() in loop() now watches the clock and logs the
  // outcome once it is set (or the timeout elapses).
  g_awaitingNtpSync = true;
  g_ntpSyncStartMs = millis();

  // Initialize schedule caches using validated UTC defaults (time-independent)
  updateResolvedScheduleFromUtc(DEFAULT_READING_HOUR_UTC, DEFAULT_READING_MINUTE_UTC);

  TS_PRINTLN("[OTA] Configure Arduino OTA flash.");
  ArduinoOTA.onStart([]()
                     {
    String type;
    if (ArduinoOTA.getCommand() == U_FLASH) {
      type = "sketch";
    }
    else { // U_FS
      type = "filesystem";
    }
    // NOTE: if updating FS this would be the place to unmount FS using FS.end()
    Serial.println("Start updating " + type); });
  ArduinoOTA.onEnd([]()
                   { EVB_PRINTLN("\nEnd updating."); });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total)
                        { TS_PRINTF("[OTA] %u%%\r\n", (progress / (total / 100))); });
  ArduinoOTA.onError([](ota_error_t error)
                     {
    if (error == OTA_AUTH_ERROR)    { TS_PRINTF("[OTA] Error[%u]: Auth Failed\n",    error); }
    else if (error == OTA_BEGIN_ERROR)   { TS_PRINTF("[OTA] Error[%u]: Begin Failed\n",   error); }
    else if (error == OTA_CONNECT_ERROR) { TS_PRINTF("[OTA] Error[%u]: Connect Failed\n", error); }
    else if (error == OTA_RECEIVE_ERROR) { TS_PRINTF("[OTA] Error[%u]: Receive Failed\n", error); }
    else if (error == OTA_END_ERROR)     { TS_PRINTF("[OTA] Error[%u]: End Failed\n",     error); }
    else                                 { TS_PRINTF("[OTA] Error[%u]: Unknown\n",         error); } });
  ArduinoOTA.setHostname("EVERBLUREADER");
  ArduinoOTA.begin();
  TS_PRINTF("[STATUS] IP address: %s\n", WiFi.localIP().toString().c_str());

  // Start WiFi serial monitor if enabled in configuration
#if WIFI_SERIAL_MONITOR_ENABLED
  wifiSerialBegin();
  TS_PRINTLN("[WIFI] WiFi Serial Monitor: ENABLED");
#else
  TS_PRINTLN("[WIFI] WiFi Serial Monitor: DISABLED");
#endif

  char triggerTopic[80];
  snprintf(triggerTopic, sizeof(triggerTopic), "%s/trigger", mqttBaseTopic);
  mqtt.subscribe(triggerTopic, [](const String &message)
                 {
    // Input validation: only accept whitelisted commands
    if (message != "update" && message != "read") {
      TS_PRINTF("[WARN] Invalid trigger command '%s' (expected 'update' or 'read')\n", message.c_str());
      char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
      mqtt.publish(topicBuffer, "Invalid trigger command", true);
      return;
    }

    // Check if we're in cooldown period
    if (g_inCooldown && (millis() - lastFailedAttempt) < RETRY_COOLDOWN) {
      unsigned long remainingCooldown = (RETRY_COOLDOWN - (millis() - lastFailedAttempt)) / 1000;
      TS_PRINTF("[WARN] Cannot trigger update: Still in cooldown period. %lu seconds remaining.\n", remainingCooldown);

      char cooldownMsg[64];
      snprintf(cooldownMsg, sizeof(cooldownMsg), "Cooldown active, %lus remaining", remainingCooldown);
      char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
      mqtt.publish(topicBuffer, cooldownMsg, true);
      return;
    }

    TS_PRINTF("[MQTT] Update data from meter from MQTT trigger (command: %s)\n", message.c_str());

    _retry = 0;
    onUpdateData(); });

  // Force trigger: an alternate topic that bypasses the cooldown period.
  // This is intended for Home Assistant buttons that should override cooldown.
  char triggerForceTopic[80];
  snprintf(triggerForceTopic, sizeof(triggerForceTopic), "%s/trigger_force", mqttBaseTopic);
  mqtt.subscribe(triggerForceTopic, [](const String &message)
                 {
    // Input validation: accept same commands as the normal trigger
    if (message != "update" && message != "read") {
      TS_PRINTF("[WARN] Invalid force-trigger command '%s' (expected 'update' or 'read')\n", message.c_str());
      char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
      mqtt.publish(topicBuffer, "Invalid trigger command", true);
      return;
    }

    TS_PRINTF("[STATUS] Force update requested via MQTT (command: %s) - overriding cooldown\n", message.c_str());

    // Immediately attempt to update, ignoring any cooldown state
    _retry = 0;
    onUpdateData(); });

  char restartTopic[80];
  snprintf(restartTopic, sizeof(restartTopic), "%s/restart", mqttBaseTopic);
  mqtt.subscribe(restartTopic, [](const String &message)
                 {
                   // Input validation: only accept exact "restart" command
                   if (message != "restart")
                   {
                     TS_PRINTF("[WARN] Invalid restart command '%s' (expected 'restart')\n", message.c_str());
                     char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
                     snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
                     mqtt.publish(topicBuffer, "Invalid restart command", true);
                     return;
                   }

                   EVB_PRINTLN("Restart command received via MQTT. Restarting in 2 seconds...");
                   char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
                   snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
                   mqtt.publish(topicBuffer, "Device restarting...", true);
                   delay(2000);   // Give time for MQTT message to be sent
                   ESP.restart(); // Restart the ESP device
                 });

  char wideFreqScanTopic[MQTT_TOPIC_BUFFER_SIZE];
  snprintf(wideFreqScanTopic, sizeof(wideFreqScanTopic), "%s/deep_scan", mqttBaseTopic);
  mqtt.subscribe(wideFreqScanTopic, [](const String &message)
                 {
    // Input validation: only accept "scan" command
    if (message != "scan") {
      TS_PRINTF("[WARN] Invalid deep scan command '%s' (expected 'scan')\n", message.c_str());
      char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
      mqtt.publish(topicBuffer, "Invalid scan command", true);
      return;
    }

    EVB_PRINTLN("Deep frequency scan command received via MQTT");
    performDeepFrequencyScan(); });

  char scanTopic[MQTT_TOPIC_BUFFER_SIZE];
  snprintf(scanTopic, sizeof(scanTopic), "%s/scan", mqttBaseTopic);
  mqtt.subscribe(scanTopic, [](const String &message) {
    if (message == "scan" && _retry == 0) startRecoveryScan(false);
  });
  snprintf(scanTopic, sizeof(scanTopic), "%s/stop_scan", mqttBaseTopic);
  mqtt.subscribe(scanTopic, [](const String &message) {
    if (message == "stop") FrequencyManager::requestScanCancel();
  });

  char resetFrequencyTopic[MQTT_TOPIC_BUFFER_SIZE];
  snprintf(resetFrequencyTopic, sizeof(resetFrequencyTopic), "%s/reset_frequency", mqttBaseTopic);
  mqtt.subscribe(resetFrequencyTopic, [](const String &message)
                 {
    // Input validation: only accept "reset" command
    if (message != "reset") {
      TS_PRINTF("[WARN] Invalid reset frequency command '%s' (expected 'reset')\n", message.c_str());
      char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
      mqtt.publish(topicBuffer, "Invalid reset command", true);
      return;
    }

    EVB_PRINTLN("Reset frequency offset command received via MQTT");
    resetFrequencyOffset(); });

