genestealer/everblu-meters-esp8266-improved/src/main.cpp
  EVB_PRINTLN("================================\n");

  return valid;
}

// Function: setup
// Description: Initializes the device, including serial communication, Wi-Fi, MQTT, and CC1101 radio with automatic calibration.
void setup()
{
  Serial.begin(115200);
  Serial.println("\n");
  // Give Serial a moment to initialize
  delay(100);

  // Parse METER_CODE into g_meterYear, g_meterSerial, and topic buffers
  // Must happen before any code uses these values
  parseMeterCode();

// On platforms with native USB Serial (e.g. some ESP32 cores) wait briefly for host to open the port
#if defined(ESP32)
  unsigned long __serial_wait_start = millis();
  while (!Serial && millis() - __serial_wait_start < 1000)
  {
    delay(10);
  }
#endif
  EVB_PRINTLN("Everblu Meters ESP8266/ESP32 Starting...");
  EVB_PRINTLN("Water/Gas usage data for Home Assistant");
  EVB_PRINTLN("https://github.com/genestealer/everblu-meters-esp8266-improved");
  TS_PRINTF("[STATUS] Firmware version: %s\n", EVERBLU_FW_VERSION);
  TS_PRINTF("[STATUS] Target meter: 20%02d-%07lu\n\n", g_meterYear, (unsigned long)g_meterSerial);

  // Initialize meter type configuration
  initMeterTypeConfig();

  // Validate configuration before proceeding
  if (!validateConfiguration())
  {
    EVB_PRINTLN("\n*** FATAL: Configuration validation failed! ***");
    EVB_PRINTLN("*** Fix the errors in private.h and reflash ***");
    EVB_PRINTLN("*** Device halted - will not continue ***\n");
    while (1)
    {
      digitalWrite(LED_BUILTIN, LOW); // Blink LED to indicate error
      delay(200);
      digitalWrite(LED_BUILTIN, HIGH);
      delay(200);
    }
  }

  // Initialize resolved schedule caches using UTC defaults and configured timezone offset
  updateResolvedScheduleFromUtc(DEFAULT_READING_HOUR_UTC, DEFAULT_READING_MINUTE_UTC);

  EVB_PRINTLN("✓ Configuration valid - proceeding with initialization\n");

  // Note: mqttBaseTopic and meterSerialStr are initialized at global scope
  // to ensure they're ready when EspMQTTClient constructor runs
  TS_PRINTF("[MQTT] Base topic: %s\n", mqttBaseTopic);
  TS_PRINTF("[MQTT] Meter serial string: %s\n", meterSerialStr);
  TS_PRINTF("[MQTT] mqttBaseTopic length: %d\n", strlen(mqttBaseTopic));

  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, LOW); // turned on to start with

  // Initialize persistent storage
#if defined(ESP8266)
  // Clear EEPROM if requested (set CLEAR_EEPROM_ON_BOOT=1 in private.h)
  // Use this when replacing ESP board, CC1101 module, or moving to a different meter.
  // The normal path leaves EEPROM init to FrequencyManager::begin() ->
  // StorageAbstraction::begin(); only the maintenance clear needs an explicit
  // EEPROM.begin() here (avoids initializing EEPROM twice on every boot).
#if CLEAR_EEPROM_ON_BOOT
  EEPROM.begin(EEPROM_SIZE);
  TS_PRINTLN("[STORAGE] CLEARING EEPROM (CLEAR_EEPROM_ON_BOOT = 1)...");
  for (int i = 0; i < EEPROM_SIZE; i++)
  {
    EEPROM.write(i, 0xFF);
  }
  EEPROM.commit();
  TS_PRINTLN("[STORAGE] EEPROM cleared. Remember to set CLEAR_EEPROM_ON_BOOT = 0 after testing!");
#endif
#endif

  // Initialize the shared FrequencyManager: register this build's radio + meter
  // callbacks, then load any persisted offset. This is the SAME implementation the
  // ESPHome build uses (src/services/frequency_manager.cpp), so the scan, adaptive
  // tracking and storage logic is single-sourced across both targets.
  FrequencyManager::setRadioInitCallback(cc1101_init);
  FrequencyManager::setMeterReadCallback(get_meter_data);
  FrequencyManager::setAutoScanEnabled(autoScanEnabled);
  FrequencyManager::setAdaptiveThreshold(ADAPT_THRESHOLD);
  FrequencyManager::begin(FREQUENCY);

  // If no valid frequency offset found and auto-scan is enabled, perform Deep scan.
  // FrequencyManager updates its own stored offset during the scan, so no reload.
  if (FrequencyManager::shouldPerformAutoScan())
  {
    TS_PRINTLN("[FREQ] No stored frequency offset found. Performing Deep frequency scan...");
    performDeepFrequencyScan();
  }
  else if (!autoScanEnabled)
  {
    TS_PRINTLN("[FREQ] AUTO_SCAN_ENABLED=0; skipping automatic frequency scan (offset remains 0.0 MHz).");
  }

  // Increase the max packet size to handle large MQTT payloads
  mqtt.setMaxPacketSize(2048); // Set to a size larger than your longest payload

  // Set the Last Will and Testament (LWT) with serial-specific topic
  // Note: mqttLwtTopic is initialized at global scope to ensure it's ready before MQTT client connects
  mqtt.enableLastWillMessage(mqttLwtTopic, "offline", true); // You can activate the retain flag by setting the third parameter to true

  // Make reconnection attempts faster and deterministic
  mqtt.setWifiReconnectionAttemptDelay(15000); // try every 15s
  mqtt.setMqttReconnectionAttemptDelay(15000); // try every 15s
  // In rare cases where the board wedges during connection attempts, allow drastic reset
  mqtt.enableDrasticResetOnConnectionFailures();

// Conditionally enable Wi-Fi PHY mode 11G (ESP8266 only).
#if defined(ESP8266)
#if ENABLE_WIFI_PHY_MODE_11G
  WiFi.setPhyMode(WIFI_PHY_MODE_11G);
  EVB_PRINTLN("Wi-Fi PHY mode set to 11G.");
#else
  TS_PRINTLN("[WIFI] Wi-Fi PHY mode 11G is disabled.");
#endif
#else
  TS_PRINTLN("[WIFI] Wi-Fi PHY mode setting not applicable on this platform.");
#endif

  // Validate and log the configured reading schedule
  TS_PRINTF("[SCHEDULE] Reading schedule (configured): %s\n", readingSchedule);
  validateReadingSchedule();
  TS_PRINTF("[SCHEDULE] Reading schedule (effective): %s\n", readingSchedule);

  // Wire the effective schedule into ScheduleManager. Without this, onScheduled()
  // calls ScheduleManager::isReadingDay(), which reads the static default
  // ("Monday-Friday") - so a configured DEFAULT_READING_SCHEDULE was honoured in
  // the logs and HA discovery but silently ignored when deciding the reading day.
  ScheduleManager::setSchedule(readingSchedule);

  // Log effective frequency and warn if default is used
  TS_PRINTF("[FREQ] Frequency (effective): %.6f MHz\n", (double)FREQUENCY);
#if FREQUENCY_DEFINED_DEFAULT
  TS_PRINTLN("[NOTE] FREQUENCY not set in private.h; using default 433.820000 MHz (RADIAN).");
#endif

  // Optional functionalities of EspMQTTClient
#if ENABLE_MQTT_DEBUGGING
  mqtt.enableDebuggingMessages(true); // Enable debugging messages sent to serial output
  EVB_PRINTLN(">> MQTT debugging enabled");
#endif

  // Set CC1101 radio frequency with automatic calibration
  TS_PRINTLN("[FREQ] Initializing CC1101 radio...");
  float effectiveFrequency = FrequencyManager::getTunedFrequency();
  if (FrequencyManager::getOffset() != 0.0)
  {
    TS_PRINTF("[FREQ] Applying stored frequency offset: %.6f MHz (effective: %.6f MHz)\n",
                  FrequencyManager::getOffset(), effectiveFrequency);
  }
  if (!cc1101_init(effectiveFrequency))
  {
    TS_PRINTLN("[WARNING] CC1101 radio initialization failed!");
    EVB_PRINTLN("Please check: 1) Wiring connections 2) 3.3V power supply 3) SPI pins");
    EVB_PRINTLN("Continuing with WiFi/MQTT only - radio functionality will not be available");
    EVB_PRINTLN("Device will remain accessible via WiFi/MQTT for diagnostics and configuration");
    cc1101RadioConnected = false;
  }
  else
  {
    TS_PRINTLN("[FREQ] CC1101 radio initialized successfully");
    cc1101RadioConnected = true;
    TS_PRINTF("[FREQ] Adaptive frequency threshold set to %d reads\n", ADAPT_THRESHOLD);
  }

